zephyrproject-rtos/zephyr/soc/nxp/imxrt/imxrt266x/soc_clock.c
/*
 * SPDX-FileCopyrightText: Copyright 2025-2026 NXP
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 * RT266x clock bring-up, adapted from the MCUXpresso SDK clock_config.c
 * (re-licensed Apache-2.0; NXP owns both copies). Diff behaviour, not text,
 * when resyncing. Only Over Drive Run is carried; __soc_clock_itcmfunc replaces
 * AT_QUICKACCESS_SECTION_CODE; the window runs on a DTCM scratch stack because
 * the stack it is entered on lives in the PSRAM the window parks; interrupts are
 * masked here.
 *
 * Clock sequence:
 *   soc_clock_init -> POWER_EnterHpRun --(callback)--> soc_clock_apply_od_run
 *     soc_clock_prepare: ConfigCGUAna, compute Sys-PLL images into DTCM, then
 *       soc_clock_handover_to_sxosc  <-- ITCM window, both XSPI parked, runs on
 *                                        soc_clock_window_stack (DTCM)
 *       then InitAudioPll / InitVideoPll (lock on the new reference)
 *     then from flash: InitCorePll, InitMainPll, then
 *       SYSCON_common, SYSCON_HPRUN, ConfigCGUDig_SS x6 domains
 */

#include <zephyr/devicetree.h>
#include <zephyr/irq.h>
#include <zephyr/linker/section_tags.h>
#include <zephyr/sys/util.h>
#include <zephyr/toolchain.h>
#include <cmsis_core.h>

#include "soc_clock.h"
#include <fsl_clock.h>
#include <fsl_iomuxc.h>
#include <fsl_power.h>
#include <fsl_modcon.h>

/*
 * This file addresses hardware via SDK <PERIPHERAL>_BASE macros, as does the
 * SDK on our behalf. Those macros follow __ARM_FEATURE_CMSE, so they resolve to
 * the secure or non-secure view by how this file is compiled. The assertion
 * below verifies devicetree and the SDK headers agree on that view; any single
 * node is enough because the secure alias is a uniform +0x10000000 offset.
 */
BUILD_ASSERT(DT_REG_ADDR(DT_NODELABEL(syscon_ccm)) == SYSCON__CCM_BASE,
	     "devicetree and SDK headers disagree on the secure/non-secure view");

/*
 * Placement for the window functions below, modelled on __ramfunc: the section
 * attribute alone does not stop the compiler from inlining a static helper into
 * its flash-resident caller, and an inlined window leaves .itcm empty and runs
 * the XSPI park sequence straight out of the XIP flash it just disabled. Bind
 * the attributes together so a helper added later cannot pick up only one.
 *
 * __ramfunc itself cannot be used: its .ramfunc section is linked into the
 * RAM_REGION built from zephyr,sram, which on this board is the XSPI1 PSRAM the
 * window parks. The flash-resident caller reaches ITCM through a veneer the
 * linker places in flash and fetches before the window opens.
 */
#define __soc_clock_itcmfunc __itcm_section __noinline

/*******************************************************************************
 * Definitions
 *****************************************************************************
 */

/* Over Drive Run frequencies (orientation; devicetree is the source of truth):
 *   SXOSC 24 MHz crystal, Core PLL 792 MHz, Main PLL VCO 2 GHz (DIVOUT1 1000 MHz),
 *   Sys PLL VCO 2 GHz (DIV4 500 MHz), Audio PLL 49.152 MHz, Video PLL 70.64 MHz.
 */

/*******************************************************************************
 * Variables
 *****************************************************************************
 */

/*
 * Analog source configuration, derived from devicetree.
 *
 * Each mirrors one nxp,imx-cguana-* node; boards change their crystal or CPU
 * frequency by editing devicetree rather than this file.
 */

#define SXOSC_NODE    DT_NODELABEL(sxosc)
#define FRO192M_NODE  DT_NODELABEL(fro192m)
#define FRO12M_NODE   DT_NODELABEL(fro12m)
#define CORE_PLL_NODE DT_NODELABEL(core_pll)
#define MAIN_PLL_NODE DT_NODELABEL(main_pll)
#define SYS_PLL_NODE  DT_NODELABEL(sys_pll)

/*
 * Steady-state clock roots, each from an nxp,imx-ccm-rev3-root node.
 * SOC_SET_ROOT_CLOCK() programs one root from its node; SOC_SET_ROOT_CLOCK_SD()
 * also carries clock-second-div for roots with a divided and second-divided
 * output (MAIN_ROOTCLK).
 */
#define SOC_SET_ROOT_CLOCK(node)                                                                   \
	do {                                                                                       \
		clock_root_config_t _cfg = {                                                       \
			.mux = DT_PROP(node, clock_mux),                                           \
			.div = DT_PROP(node, clock_div),                                           \
			.sndDiv = 1U,                                                              \
		};                                                                                 \
		CLOCK_SetRootClock((clock_root_t)DT_PROP(node, nxp_root_id), &_cfg);               \
	} while (0)

#define SOC_SET_ROOT_CLOCK_SD(node)                                                                \
	do {                                                                                       \
		clock_root_config_t _cfg = {                                                       \
			.mux = DT_PROP(node, clock_mux),                                           \
			.div = DT_PROP(node, clock_div),                                           \
			.sndDiv = DT_PROP(node, clock_second_div),                                 \
		};                                                                                 \
		CLOCK_SetRootClock((clock_root_t)DT_PROP(node, nxp_root_id), &_cfg);               \
	} while (0)

/* A PLL's reference is a clocks phandle, so its rate cannot disagree with it. */
#define SOC_PLL_REF_HZ(node) DT_PROP(DT_CLOCKS_CTLR(node), clock_frequency)

#define SOC_CGUANA_REF_FREQ(hz)                                                                    \
	((hz) == 19200000   ? kCLOCK_CguanaRefFreq19p2M                                            \
	 : (hz) == 24000000 ? kCLOCK_CguanaRefFreq24M                                              \
	 : (hz) == 32000000 ? kCLOCK_CguanaRefFreq32M                                              \
	 : (hz) == 40000000 ? kCLOCK_CguanaRefFreq40M                                              \
			    : -1)

