zephyrproject-rtos/zephyr/soc/nxp/imxrt/imxrt266x/soc_clock.c
#define SOC_SXOSC_MODE(node)                                                                       \
	(DT_ENUM_HAS_VALUE(node, nxp_mode, crystal)     ? kCLOCK_CguanaSxoscModeCrystal            \
	 : DT_ENUM_HAS_VALUE(node, nxp_mode, ac_slave)  ? kCLOCK_CguanaSxoscModeAcSlave            \
	 : DT_ENUM_HAS_VALUE(node, nxp_mode, dc_bypass) ? kCLOCK_CguanaSxoscModeDcBypass           \
							: kCLOCK_CguanaSxoscModeDcBypassNoDet)

BUILD_ASSERT(SOC_CGUANA_REF_FREQ(SOC_PLL_REF_HZ(CORE_PLL_NODE)) != -1,
	     "core PLL reference frequency is not one the hardware offers");
BUILD_ASSERT(SOC_CGUANA_REF_FREQ(SOC_PLL_REF_HZ(MAIN_PLL_NODE)) != -1,
	     "main PLL reference frequency is not one the hardware offers");
BUILD_ASSERT(SOC_CGUANA_REF_FREQ(SOC_PLL_REF_HZ(SYS_PLL_NODE)) != -1,
	     "sys PLL reference frequency is not one the hardware offers");

/*
 * The core PLL output is its reference multiplied by the loop divider, halved if
 * the post divider is on. Check the output devicetree states against that rather
 * than trusting it, so a mismatch is a build error and not a surprise on the
 * bench.
 */
BUILD_ASSERT(DT_PROP(CORE_PLL_NODE, clock_frequency) ==
		     (SOC_PLL_REF_HZ(CORE_PLL_NODE) * DT_PROP(CORE_PLL_NODE, nxp_loop_div)) /
			     (DT_PROP(CORE_PLL_NODE, nxp_post_div_by_2) ? 2 : 1),
	     "core PLL clock-frequency disagrees with its loop and post dividers");

static const clock_cguana_sxosc_config_t s_sxoscConfig = {
	.modeSel = SOC_SXOSC_MODE(SXOSC_NODE),
	.gmSel = DT_PROP(SXOSC_NODE, nxp_gm_sel),
	.xtal1CapTrim = DT_PROP_BY_IDX(SXOSC_NODE, nxp_cap_trim, 0),
	.xtal2CapTrim = DT_PROP_BY_IDX(SXOSC_NODE, nxp_cap_trim, 1),
	.detTrim = DT_PROP(SXOSC_NODE, nxp_det_trim),
	.clkDiv2En = DT_PROP(SXOSC_NODE, nxp_div2_enable),
};

#define SOC_FRO192M_OTWB(hz)                                                                       \
	((hz) == 96000000    ? kCLOCK_CguanaFro192mOtwb96M                                         \
	 : (hz) == 120000000 ? kCLOCK_CguanaFro192mOtwb120M                                        \
	 : (hz) == 144000000 ? kCLOCK_CguanaFro192mOtwb144M                                        \
	 : (hz) == 192000000 ? kCLOCK_CguanaFro192mOtwb192M                                        \
	 : (hz) == 240000000 ? kCLOCK_CguanaFro192mOtwb240M                                        \
	 : (hz) == 288000000 ? kCLOCK_CguanaFro192mOtwb288M                                        \
	 : (hz) == 384000000 ? kCLOCK_CguanaFro192mOtwb384M                                        \
	 : (hz) == 480000000 ? kCLOCK_CguanaFro192mOtwb480M                                        \
			     : -1)

#define SOC_FRO12M_OTWB(hz)                                                                        \
	((hz) == 8000000    ? kCLOCK_CguanaFro12mOtwb8M                                            \
	 : (hz) == 10000000 ? kCLOCK_CguanaFro12mOtwb10M                                           \
	 : (hz) == 12000000 ? kCLOCK_CguanaFro12mOtwb12M                                           \
	 : (hz) == 12288000 ? kCLOCK_CguanaFro12mOtwb12p288M                                       \
	 : (hz) == 16000000 ? kCLOCK_CguanaFro12mOtwb16M                                           \
	 : (hz) == 20000000 ? kCLOCK_CguanaFro12mOtwb20M                                           \
	 : (hz) == 24000000 ? kCLOCK_CguanaFro12mOtwb24M                                           \
	 : (hz) == 32000000 ? kCLOCK_CguanaFro12mOtwb32M                                           \
			    : -1)

BUILD_ASSERT(SOC_FRO192M_OTWB(DT_PROP(FRO192M_NODE, clock_frequency)) != -1,
	     "fro192m clock-frequency is not one of the bands the hardware offers");
BUILD_ASSERT(SOC_FRO12M_OTWB(DT_PROP(FRO12M_NODE, clock_frequency)) != -1,
	     "fro12m clock-frequency is not one of the bands the hardware offers");

static const clock_cguana_fro192m_config_t s_fro192mConfig = {
	.otwb = SOC_FRO192M_OTWB(DT_PROP(FRO192M_NODE, clock_frequency)),
};

static const clock_cguana_fro12m_config_t s_fro12mConfig = {
	.otwb = SOC_FRO12M_OTWB(DT_PROP(FRO12M_NODE, clock_frequency)),
};

static const clock_cguana_core_pll_config_t s_corePllConfig = {
	.vcoSelHf = DT_PROP(CORE_PLL_NODE, nxp_vco_high_band),
	.refFreq = SOC_CGUANA_REF_FREQ(SOC_PLL_REF_HZ(CORE_PLL_NODE)),
	.loopDivNint = DT_PROP(CORE_PLL_NODE, nxp_loop_div),
	.postDivBy2 = DT_PROP(CORE_PLL_NODE, nxp_post_div_by_2),
};

#define SOC_FRAC_PLL_VCO(hz)                                                                       \
	((hz) == 2000000000   ? kCLOCK_CguanaFracPllVco2000M                                       \
	 : (hz) == 1950000000 ? kCLOCK_CguanaFracPllVco1950M                                       \
	 : (hz) == 1900000000 ? kCLOCK_CguanaFracPllVco1900M                                       \
	 : (hz) == 1850000000 ? kCLOCK_CguanaFracPllVco1850M                                       \
			      : -1)

#define SOC_INT_DIV_MATCH(node, prop, idx, d) (DT_PROP_BY_IDX(node, prop, idx) == (d)) ||

#define SOC_HAS_INT_DIV(node, d)                                                                   \
	(DT_FOREACH_PROP_ELEM_VARGS(node, nxp_int_divs, SOC_INT_DIV_MATCH, d) false)

/* A selector of zero leaves that fractional output disabled. */
#define SOC_FRAC_DIV(node, idx)                                                                    \
	{                                                                                          \
		.en = DT_PROP_BY_IDX(node, nxp_frac_div_sels, idx) != 0,                           \
		.range = false,                                                                    \
		.sel = DT_PROP_BY_IDX(node, nxp_frac_div_sels, idx),                               \
	}

#define SOC_FRAC_PLL_CONFIG(node)                                                                  \
	{                                                                                          \
		.refFreq = SOC_CGUANA_REF_FREQ(SOC_PLL_REF_HZ(node)),                              \
		.lowFreq = SOC_FRAC_PLL_VCO(DT_PROP(node, nxp_vco_frequency)),                     \
		.div5En = SOC_HAS_INT_DIV(node, 5),                                                \
		.div8En = SOC_HAS_INT_DIV(node, 8),                                                \
		.div10En = SOC_HAS_INT_DIV(node, 10),                                              \
		.div20En = SOC_HAS_INT_DIV(node, 20),                                              \
		.fracDiv = {SOC_FRAC_DIV(node, 0), SOC_FRAC_DIV(node, 1), SOC_FRAC_DIV(node, 2)},  \
		.sscgEn = false,                                                                   \
		.sscg = NULL,                                                                      \
	}

BUILD_ASSERT(SOC_FRAC_PLL_VCO(DT_PROP(MAIN_PLL_NODE, nxp_vco_frequency)) != -1,
	     "main PLL nxp,vco-frequency is not one the hardware offers");
BUILD_ASSERT(SOC_FRAC_PLL_VCO(DT_PROP(SYS_PLL_NODE, nxp_vco_frequency)) != -1,
	     "sys PLL nxp,vco-frequency is not one the hardware offers");

