zephyrproject-rtos/zephyr/soc/nxp/imxrt/imxrt266x/soc_clock.c
/*
 * The main PLL's second fractional output drives the CPU: PLL_PFDX ->
 * MAIN_ROOTCLK -> cpu_clk. Selector counts quarter steps; output =
 * vco-frequency * 4 / selector. Check against cpu0 clock-frequency so
 * a mismatch is a build error.
 */
#define SOC_MAIN_PLL_DIVOUT1_HZ                                                                    \
	((DT_PROP(MAIN_PLL_NODE, nxp_vco_frequency) /                                              \
	  DT_PROP_BY_IDX(MAIN_PLL_NODE, nxp_frac_div_sels, 1)) *                                   \
	 4U)

BUILD_ASSERT(SOC_MAIN_PLL_DIVOUT1_HZ == DT_PROP(DT_PATH(cpus, cpu_0), clock_frequency),
	     "cpu0 clock-frequency disagrees with the main PLL output that drives it");

static const clock_cguana_frac_pll_config_t s_mainPllConfig = SOC_FRAC_PLL_CONFIG(MAIN_PLL_NODE);
static const clock_cguana_frac_pll_config_t s_sysPllConfig = SOC_FRAC_PLL_CONFIG(SYS_PLL_NODE);

/*
 * Audio and video PLLs are re-locked after the reference hand-over because the
 * window moves the reference they were locked to. Parameters come from their
 * nxp,imx-cguana-avpll nodes; refFreq and start mode are C constants.
 */
#define AVPLL_AUDIO_NODE DT_NODELABEL(avpll_audio)
#define AVPLL_VIDEO_NODE DT_NODELABEL(avpll_video)

/* Audio PLL: 49.152 MHz (48 kHz audio family), CCO band 6, POSTDIV=16. */
static const clock_cguana_avpll_config_t s_audioPllConfig = {
	.refFreq = kCLOCK_CguanaRefFreq24M,
	.ccoBandSel = DT_PROP(AVPLL_AUDIO_NODE, nxp_cco_band_sel),
	.postDivRatio = DT_PROP(AVPLL_AUDIO_NODE, nxp_post_div_ratio),
	.dnum = DT_PROP(AVPLL_AUDIO_NODE, nxp_dnum),
	.sscgEn = false,
	.sscg = NULL,
};

/* Video PLL: 70.64 MHz (display panel reference), CCO band 5, POSTDIV=11,
 * DNUM=0x181B4E82 (fractional offset to hit 70.64 MHz exactly).
 */
static const clock_cguana_avpll_config_t s_videoPllConfig = {
	.refFreq = kCLOCK_CguanaRefFreq24M,
	.ccoBandSel = DT_PROP(AVPLL_VIDEO_NODE, nxp_cco_band_sel),
	.postDivRatio = DT_PROP(AVPLL_VIDEO_NODE, nxp_post_div_ratio),
	/* dnum: (113/300) x 2^30 -> 70.64 MHz */
	.dnum = DT_PROP(AVPLL_VIDEO_NODE, nxp_dnum),
	.sscgEn = false,
	.sscg = NULL,
};

/*******************************************************************************
 ************************ BOARD_InitBootClocks function ************************
 *****************************************************************************
 */
/* Called only through the POWER_EnterHpRun callback in soc_clock_init(). */
static void soc_clock_apply_od_run(void);

void soc_clock_init(void)
{
	POWER_EnterHpRun(soc_clock_apply_od_run);
}

/*******************************************************************************
 ************************ Configuration soc_clock_apply_od_run *******************
 *****************************************************************************
 */
/* CGUDig is split into a shared (mode-invariant) block and a per-mode block for
 * the three CGU slices whose source/divider depend on the operating point
 * (CGU_MAIN_ROOTCLK, CGU_NPU_ROOTCLK, CGU_MEDIABUS_ROOTCLK).
 */
static void ConfigCGUAna(void);
static void ConfigCGUDig_SS(void);
static void ConfigCGUDig_SYSCON_common(void);
static void ConfigCGUDig_SYSCON_HPRUN(void);
static void ConfigCGUDig_CMPT(void);
static void ConfigCGUDig_MAIN(void);
static void ConfigCGUDig_MEDIA(void);
static void ConfigCGUDig_AUDIO(void);
static void ConfigCGUDig_COMM(void);
static void ConfigCGUDig_WAKE(void);

/* XSPI clock-switch step for the two per-controller window helpers below. Each helper is
 * called twice by soc_clock_handover_to_sxosc -- once to park the controller before
 * the PLL work, once to move it onto the re-locked Sys PLL afterwards.
 */
typedef enum _board_xspi_clock_step {
	/*!<
	 * Quiesce + disable the XSPI, park its clock on FRO192M (window entry,
	 * before any PLL is touched).
	 */
	kSocXspiParkOnFro192m = 0U,
	/*!<
	 * Move the XSPI clock to SysPLL DIV4 and re-enable it (window exit,
	 * after the SYS PLL has re-locked).
	 */
	kSocXspiRunOnSysPllDiv4,
} soc_xspi_park_step_t;

/*
 * The sys PLL register images the hand-over programs, in DTCM.
 *
 * Computed before the window opens, while the flash this code executes from is
 * still readable, and read inside it once neither external memory is available.
 */
static uint32_t __dtcm_noinit_section soc_clock_syspll_regs[4];

/* XSPI0 (NOR XIP) window helper -- two steps called by soc_clock_handover_to_sxosc:
 *
 *   kSocXspiParkOnFro192m: ensure the clock gate is on, quiesce (block prefetch,
 *     abort in-flight, wait for idle), MDIS, park its clock on FRO192M.
 *     MDIS'ing mid-access wedges XIP.
 *
 *   kSocXspiRunOnSysPllDiv4: switch fclock to SYSPLLDIV4 (500 MHz) with
 *     div=2 (2x=250 MHz) and sndDiv=2 (SCK=125 MHz) -- SND_DIV=1 would make
 *     2x == SCK and corrupt DQS-loopback reads. Restore prefetch and re-enable.
 */
static void __soc_clock_itcmfunc soc_clock_park_xspi0(soc_xspi_park_step_t step)
{
	uint32_t v;
	uint32_t i;

	if (step == kSocXspiParkOnFro192m) {
		/* CGC_ROOT must be on before any clock root mux is touched. */
		MAIN__CCM->CGC_ROOT[(uint32_t)kCLOCK_MAIN_xspi0 - (uint32_t)kCLOCK_MAIN_START]
			.SLICE_CONTROL |= CCM_SLICE_CONTROL_LPCG_CFG_MASK;
		__DSB();
		__ISB();

		/* Quiesce: block new AHB read-prefetch, abort in-flight, bounded wait for idle. */
		MAIN__XSPI_0->SPTRCLR |= XSPI_SPTRCLR_PREFETCH_DIS_MASK;
		MAIN__XSPI_0->SPTRCLR |= XSPI_SPTRCLR_ABRT_CLR_MASK;
		__DSB();
		__ISB();
		for (i = 0U; ((MAIN__XSPI_0->SR & (XSPI_SR_BUSY_MASK | XSPI_SR_AHB_ACC_MASK |
						   XSPI_SR_IP_ACC_MASK)) != 0U) &&
			     (i < 1000000U);
		     i++) {
		}

		/* Now safe to disable; stays disabled until the kSocXspiRunOnSysPllDiv4 step. */
		MAIN__XSPI_0->MCR |= XSPI_MCR_MDIS_MASK;
		__DSB();
		__ISB();

		/* Park the clock path on FRO192M: PERI_ROOTCLK0 -> BASE, xspi0_fclk -> mux0. */
		v = SYSCON__CCM->CLOCK_ROOT[kCLOCK_Root_CGU_PERI_ROOTCLK0].SLICE_CONTROL;
		v &= ~CCM_SLICE_CONTROL_MUX_MASK;
		v |= CCM_SLICE_CONTROL_MUX((uint32_t)kCLOCK_PERI0_ClockRoot_BASE);
		SYSCON__CCM->CLOCK_ROOT[kCLOCK_Root_CGU_PERI_ROOTCLK0].SLICE_CONTROL = v;

		v = MAIN__CCM->CLOCK_ROOT[1].SLICE_CONTROL; /* xspi0_fclk */
		v &= ~CCM_SLICE_CONTROL_MUX_MASK;
		v |= CCM_SLICE_CONTROL_MUX((uint32_t)kCLOCK_XSPI0_ClockRoot_MAIN_PERI0_DIV2);
		MAIN__CCM->CLOCK_ROOT[1].SLICE_CONTROL = v;
		__DSB();
		__ISB();
		(void)MAIN__CCM->CLOCK_ROOT[1]
			.SLICE_CONTROL; /* CM85 posted-write read-back flush */
	} else {
		/* SYSPLLDIV4 mux, div=2 (250 MHz 2x), sndDiv=2 (125 MHz SCK). */
		v = MAIN__CCM->CLOCK_ROOT[1].SLICE_CONTROL;
		v &= ~(CCM_SLICE_CONTROL_MUX_MASK | CCM_SLICE_CONTROL_DIV_MASK |
		       CCM_SLICE_CONTROL_SND_DIV_MASK);
		v |= CCM_SLICE_CONTROL_MUX(2U) | CCM_SLICE_CONTROL_DIV(2U - 1U) |
		     CCM_SLICE_CONTROL_SND_DIV(2U - 1U);
		MAIN__CCM->CLOCK_ROOT[1].SLICE_CONTROL = v;
		__DSB();
		__ISB();
		(void)MAIN__CCM->CLOCK_ROOT[1]
			.SLICE_CONTROL; /* CM85 posted-write read-back flush */

		/* Restore normal prefetch FIRST (still disabled), THEN the window's single
		 * re-enable.
		 */
		MAIN__XSPI_0->SPTRCLR &= ~XSPI_SPTRCLR_PREFETCH_DIS_MASK;
		MAIN__XSPI_0->MCR &= ~XSPI_MCR_MDIS_MASK;
		__DSB();
		__ISB();
	}
}

/* XSPI1 (DDR PSRAM) window helper -- mirror of soc_clock_park_xspi0:
 *
 *   kSocXspiParkOnFro192m: gate on, quiesce, MDIS, park on FRO192M.
 *
 *   kSocXspiRunOnSysPllDiv4: switch to SYSPLLDIV4 (500 MHz), copying ROM's
 *     DIV(/1)/SND_DIV(/2) so the PSRAM SCK (250 MHz) and ROM DLL calibration
 *     point are preserved. The clock SOURCE still changes (Main->Sys PLL), so
 *     re-lock the controller DLL -- but ONLY if XSPI1 holds a live DDR PSRAM
 *     (runtime gate on MCR.X16_EN). DLLCR[0] is zeroed then re-armed to
 *     0xC260001C (DLLEN|FREQEN|REFCNTR2|RES6|CDL8|AUTO_UPD|SLV_EN);
 *     SMPR tap=4. XSPI_UpdateDllValue is NOT used (drops FREQEN below its
 *     auto-update threshold). Restore prefetch, re-enable, pulse serial
 *     soft-reset (live PSRAM only).
 *
 * Must be RAM-resident for the psram_txt build where code runs from PSRAM.
 */
static void __soc_clock_itcmfunc soc_clock_park_xspi1(soc_xspi_park_step_t step)
{
	uint32_t v;
	uint32_t i;
	bool livePsram;

	if (step == kSocXspiParkOnFro192m) {
		/* CGC_ROOT must be on before any clock root mux is touched. */
		MAIN__CCM->CGC_ROOT[(uint32_t)kCLOCK_MAIN_xspi1 - (uint32_t)kCLOCK_MAIN_START]
			.SLICE_CONTROL |= CCM_SLICE_CONTROL_LPCG_CFG_MASK;
		__DSB();
		__ISB();

		/* Quiesce: block new AHB read-prefetch, abort in-flight, bounded wait for idle. */
		MAIN__XSPI_1->SPTRCLR |= XSPI_SPTRCLR_PREFETCH_DIS_MASK;
		MAIN__XSPI_1->SPTRCLR |= XSPI_SPTRCLR_ABRT_CLR_MASK;
		__DSB();
		__ISB();
		for (i = 0U; ((MAIN__XSPI_1->SR & (XSPI_SR_BUSY_MASK | XSPI_SR_AHB_ACC_MASK |
						   XSPI_SR_IP_ACC_MASK)) != 0U) &&
			     (i < 1000000U);
		     i++) {
		}

		/* Now safe to disable; stays disabled until the kSocXspiRunOnSysPllDiv4 step. */
		MAIN__XSPI_1->MCR |= XSPI_MCR_MDIS_MASK;
		__DSB();
		__ISB();

		/* Park the clock path on FRO192M: PERI_ROOTCLK1 -> BASE, xspi1_fclk -> mux0. */
		v = SYSCON__CCM->CLOCK_ROOT[kCLOCK_Root_CGU_PERI_ROOTCLK1].SLICE_CONTROL;
		v &= ~CCM_SLICE_CONTROL_MUX_MASK;
		v |= CCM_SLICE_CONTROL_MUX((uint32_t)kCLOCK_PERI1_ClockRoot_BASE);
		SYSCON__CCM->CLOCK_ROOT[kCLOCK_Root_CGU_PERI_ROOTCLK1].SLICE_CONTROL = v;

