zephyrproject-rtos/zephyr/soc/nxp/imxrt/imxrt266x/soc_clock.c
		v = MAIN__CCM->CLOCK_ROOT[2].SLICE_CONTROL; /* xspi1_fclk */
		v &= ~CCM_SLICE_CONTROL_MUX_MASK;
		v |= CCM_SLICE_CONTROL_MUX((uint32_t)kCLOCK_XSPI1_ClockRoot_MAIN_PERI1_DIV2);
		MAIN__CCM->CLOCK_ROOT[2].SLICE_CONTROL = v;
		__DSB();
		__ISB();
		(void)MAIN__CCM->CLOCK_ROOT[2]
			.SLICE_CONTROL; /* CM85 posted-write read-back flush */
	} else {
		livePsram = ((MAIN__XSPI_1->MCR & XSPI_MCR_X16_EN_MASK) !=
			     0U); /* ROM brought up DDR PSRAM? */

		/* SYSPLLDIV4 mux, div=1 (500 MHz 2x), sndDiv=2 (250 MHz SCK). */
		v = MAIN__CCM->CLOCK_ROOT[2].SLICE_CONTROL;
		v &= ~(CCM_SLICE_CONTROL_MUX_MASK | CCM_SLICE_CONTROL_DIV_MASK |
		       CCM_SLICE_CONTROL_SND_DIV_MASK);
		v |= CCM_SLICE_CONTROL_MUX(2U) | CCM_SLICE_CONTROL_DIV(1U - 1U) |
		     CCM_SLICE_CONTROL_SND_DIV(2U - 1U);
		MAIN__CCM->CLOCK_ROOT[2].SLICE_CONTROL = v;
		__DSB();
		__ISB();
		(void)MAIN__CCM->CLOCK_ROOT[2]
			.SLICE_CONTROL; /* CM85 posted-write read-back flush */

		/* Still MDIS'd: re-lock the DDR read DLL for the new clock SOURCE (live PSRAM
		 * only).
		 */
		if (livePsram) {
			MAIN__XSPI_1->DLLCR[0] = 0U; /* drop the stale (Main-PLL-clock) lock */
			MAIN__XSPI_1->DLLCR[0] =
				0xC260001CU; /* re-arm auto-DLL for the Sys-PLL clock */
			for (i = 0U; ((MAIN__XSPI_1->DLLSR & XSPI_DLLSR_SLVA_LOCK_MASK) == 0U) &&
				     (i < 100000U);
			     i++) {
			}
			MAIN__XSPI_1->SMPR =
				0x04000000U; /* DLLFSMPFA tap = 4 (working-state value) */
		}

		/* Restore normal prefetch FIRST (still disabled), THEN the window's single
		 * re-enable. For live PSRAM, a serial soft-reset pulse settles the interface on the
		 * new clock.
		 */
		MAIN__XSPI_1->SPTRCLR &= ~XSPI_SPTRCLR_PREFETCH_DIS_MASK;
		MAIN__XSPI_1->MCR &= ~XSPI_MCR_MDIS_MASK;
		if (livePsram) {
			MAIN__XSPI_1->MCR |= XSPI_MCR_SWRSTSD_MASK;
			MAIN__XSPI_1->MCR &= ~XSPI_MCR_SWRSTSD_MASK;
		}
		__DSB();
		__ISB();
	}
}

/* Select SXOSC as the OSC_24M source (MODCON CLK24M_SEL: 0=FRO24M reset default,
 * 1=SXOSC). Done from RAM with a direct register write to avoid fetching over
 * XSPI0 flash across the transient. SXOSC must already be running.
 */
static void __soc_clock_itcmfunc soc_clock_select_sxosc_ref(void)
{
	MAIN__MODCON->IP[getModConOffset((uint32_t)kModCon_MAIN_CLK24M_SEL)].CFG[0] = 0x1U;

	__DSB();
	__ISB();
	(void)MAIN__MODCON->IP[getModConOffset((uint32_t)kModCon_MAIN_CLK24M_SEL)].CFG[0];
}

/* Precompute the four SYSPLL register images from the SYSPLL config while flash
 * is still accessible, so soc_clock_handover_to_sxosc needs no .rodata read.
 * Mirrors CGUANA_ConfigFracPllRegs; SYSPLL and MAINPLL share the PLLn layout.
 */
static void soc_clock_compute_sys_pll_regs(const clock_cguana_frac_pll_config_t *cfg,
					   uint32_t *pll1, uint32_t *pll2, uint32_t *pll3,
					   uint32_t *pll4)
{
	*pll1 = (cfg->div5En ? CGUANA_CGUA_MAINPLL_PLL1_REG_MAINPLL_DIV5_EN_MASK : 0U) |
		(cfg->div8En ? CGUANA_CGUA_MAINPLL_PLL1_REG_MAINPLL_DIV8_EN_MASK : 0U) |
		(cfg->div10En ? CGUANA_CGUA_MAINPLL_PLL1_REG_MAINPLL_DIV10_EN_MASK : 0U) |
		(cfg->div20En ? CGUANA_CGUA_MAINPLL_PLL1_REG_MAINPLL_DIV20_EN_MASK : 0U);

	*pll2 = (cfg->fracDiv[0].en ? CGUANA_CGUA_MAINPLL_PLL2_REG_MAINPLL_DIVFRAC0_EN_MASK : 0U) |
		(cfg->fracDiv[0].range ? CGUANA_CGUA_MAINPLL_PLL2_REG_MAINPLL_DIVFRAC0_RANGE_MASK
				       : 0U) |
		CGUANA_CGUA_MAINPLL_PLL2_REG_MAINPLL_DIVFRAC0_SEL(cfg->fracDiv[0].sel) |
		(cfg->fracDiv[1].en ? CGUANA_CGUA_MAINPLL_PLL2_REG_MAINPLL_DIVFRAC1_EN_MASK : 0U) |
		(cfg->fracDiv[1].range ? CGUANA_CGUA_MAINPLL_PLL2_REG_MAINPLL_DIVFRAC1_RANGE_MASK
				       : 0U) |
		CGUANA_CGUA_MAINPLL_PLL2_REG_MAINPLL_DIVFRAC1_SEL(cfg->fracDiv[1].sel) |
		(cfg->fracDiv[2].en ? CGUANA_CGUA_MAINPLL_PLL2_REG_MAINPLL_DIVFRAC2_EN_MASK : 0U) |
		(cfg->fracDiv[2].range ? CGUANA_CGUA_MAINPLL_PLL2_REG_MAINPLL_DIVFRAC2_RANGE_MASK
				       : 0U) |
		CGUANA_CGUA_MAINPLL_PLL2_REG_MAINPLL_DIVFRAC2_SEL(cfg->fracDiv[2].sel);

	*pll3 = CGUANA_CGUA_MAINPLL_PLL3_REG_MAINPLL_FREF_SET((uint32_t)cfg->refFreq) |
		CGUANA_CGUA_MAINPLL_PLL3_REG_MAINPLL_LOWFREQ(cfg->lowFreq);

	/* s_sysPllConfig.sscgEn is false -> PLL4 = 0. (SSCG path intentionally omitted; the
	 * RAM window must not depend on the flash-resident sscg sub-struct.)
	 */
	*pll4 = 0U;
}

/* Glitchless crystal hand-over for the CMS PLLs -- the hazardous RAM window.
 * Direct register writes only; SDK driver code and its tables live in the XSPI0
 * flash that is torn down mid-window.
 *
 * Flipping the CMS PLL reference while the ROM Main PLL feeds XIP flash and
 * PSRAM glitches the PLL and it can fail to re-lock. Every CMS PLL is powered
 * down first, the reference switched with no running loop, then PLLs re-locked
 * fresh on the crystal.
 *
 * Ordering: both XSPI clock roots MUST be parked on FRO192M before the core is
 * parked, before bus roots are detached, and before any PLL is powered down.
 * Doing it after the core/bus move corrupts XIP.
 *
 *   [0] Disable L1 caches and turn the LLC off.
 *   [1] Force BASE_CLK -> FRO192M.
 *   [2] Quiesce, MDIS and park both XSPI on FRO192M.
 *   [3] Park CM85 core on FRO192M; detach remaining CGU bus roots from PLLs.
 *   [4] Power down MAIN + CORE + SYS PLL; wait for RDY to clear.
 *   [5] Switch CMS and AV PLL reference to SXOSC; switch OSC_24M with it.
 *   [6] Re-program and power up SYS PLL on the crystal reference; wait for RDY.
 *   [7] Bring up SYSPLLDIV4_ROOTCLK (500 MHz).
 *   [8] Hop both XSPI fclocks onto SysPLL DIV4 and re-enable. XIP and PSRAM live.
 *   [9] Restore LLC policy and L1 caches.
 *
 * Core PLL and Main PLL are left down; the flash-resident caller re-inits them.
 */
static void __soc_clock_itcmfunc soc_clock_handover_to_sxosc(void)
{
	/* CORE/MAIN/SYS PLLs, all three powered down before the reference switch
	 * so none can pass the glitch to a consumer.
	 */
	const uint32_t cmsFsm =
		CLOCK_CGUANA_FSM_MAINPLL | CLOCK_CGUANA_FSM_COREPLL | CLOCK_CGUANA_FSM_SYSPLL;
	uint32_t v;
	uint32_t i;
	uint32_t llcCtcr;
	bool dCacheOn;
	bool iCacheOn;

	/* [Step 0] Disable L1 D/I caches (only the ones currently on) and the LLC.
	 * The LLC write MUST run from ITCM: in the psram_txt build the caller runs
	 * from the PSRAM path this clears, and the next fetch after LOOKUPEN|FILLEN
	 * clear would bus-fault. Policy is restored in step 9.
	 */
	dCacheOn = ((SCB->CCR & SCB_CCR_DC_Msk) != 0U);
	iCacheOn = ((SCB->CCR & SCB_CCR_IC_Msk) != 0U);
	if (dCacheOn) {
		SCB_DisableDCache(); /* clean + invalidate + disable L1 D-cache */
	}
	if (iCacheOn) {
		SCB_DisableICache();
	}
	llcCtcr = CMPT__LLC->CCUCTCR;
	CMPT__LLC->CCUCTCR = llcCtcr & ~(LLC_CCUCTCR_LOOKUPEN_MASK | LLC_CCUCTCR_FILLEN_MASK);
	__DSB();
	__ISB();

	/* [Step 1] Force BASE_CLK -> FRO192M first; it is the shared park source for
	 * every root parked below. Read-back + DSB/ISB order the posted write.
	 */
	v = SYSCON__CCM->CLOCK_ROOT[kCLOCK_Root_CGU_BASE_CLK].SLICE_CONTROL;
	v &= ~CCM_SLICE_CONTROL_MUX_MASK;
	v |= CCM_SLICE_CONTROL_MUX((uint32_t)kCLOCK_BASE_ClockRoot_FRO_192M);
	SYSCON__CCM->CLOCK_ROOT[kCLOCK_Root_CGU_BASE_CLK].SLICE_CONTROL = v;
	__DSB();
	__ISB();
	(void)SYSCON__CCM->CLOCK_ROOT[kCLOCK_Root_CGU_BASE_CLK].SLICE_CONTROL;

