zephyrproject-rtos/zephyr/soc/nxp/imxrt/imxrt266x/soc_clock.c
	/* [Step 2] Park BOTH flash controllers on FRO192M before any PLL/reference
	 * perturbation, while the system is still fully clocked and stable.
	 */
	soc_clock_park_xspi0(kSocXspiParkOnFro192m);
	soc_clock_park_xspi1(kSocXspiParkOnFro192m);

	/* [Step 3a] Park CM85 core on FRO192M (MAIN_ROOTCLK mux -> BASE); runs from
	 * ITCM so the CPU keeps executing across the hop.
	 */
	v = SYSCON__CCM->CLOCK_ROOT[kCLOCK_Root_CGU_MAIN_ROOTCLK].SLICE_CONTROL;
	v &= ~CCM_SLICE_CONTROL_MUX_MASK;
	v |= CCM_SLICE_CONTROL_MUX((uint32_t)kCLOCK_CGU_MAIN_ClockRoot_BASE);
	SYSCON__CCM->CLOCK_ROOT[kCLOCK_Root_CGU_MAIN_ROOTCLK].SLICE_CONTROL = v;
	__DSB();
	__ISB();
	(void)SYSCON__CCM->CLOCK_ROOT[kCLOCK_Root_CGU_MAIN_ROOTCLK].SLICE_CONTROL;

	/* [Step 3b] Detach remaining CMS-PLL-fed CGU bus roots onto FRO192M so nothing
	 * rides MAIN/CORE/SYS PLL when they are powered down in step 4. WAKEBUS has no
	 * BASE mux option, so takes FRO_192M directly. SYSCON_PDMAIN_CLK has no BASE mux
	 * either -- park on FRO_48M; ConfigCGUDig_SYSCON_common() restores it post-window.
	 */
	v = SYSCON__CCM->CLOCK_ROOT[kCLOCK_Root_CGU_NPU_ROOTCLK].SLICE_CONTROL;
	v &= ~CCM_SLICE_CONTROL_MUX_MASK;
	v |= CCM_SLICE_CONTROL_MUX((uint32_t)kCLOCK_NPU_ClockRoot_BASE);
	SYSCON__CCM->CLOCK_ROOT[kCLOCK_Root_CGU_NPU_ROOTCLK].SLICE_CONTROL = v;

	v = SYSCON__CCM->CLOCK_ROOT[kCLOCK_Root_CGU_MEDIABUS_ROOTCLK].SLICE_CONTROL;
	v &= ~CCM_SLICE_CONTROL_MUX_MASK;
	v |= CCM_SLICE_CONTROL_MUX((uint32_t)kCLOCK_MEDIABUS_ClockRoot_BASE);
	SYSCON__CCM->CLOCK_ROOT[kCLOCK_Root_CGU_MEDIABUS_ROOTCLK].SLICE_CONTROL = v;

	v = SYSCON__CCM->CLOCK_ROOT[kCLOCK_Root_CGU_AUDIOBUS_ROOTCLK].SLICE_CONTROL;
	v &= ~CCM_SLICE_CONTROL_MUX_MASK;
	v |= CCM_SLICE_CONTROL_MUX((uint32_t)kCLOCK_AUDIOBUS_ClockRoot_BASE);
	SYSCON__CCM->CLOCK_ROOT[kCLOCK_Root_CGU_AUDIOBUS_ROOTCLK].SLICE_CONTROL = v;

	v = SYSCON__CCM->CLOCK_ROOT[kCLOCK_Root_CGU_COMMBUS_ROOTCLK].SLICE_CONTROL;
	v &= ~CCM_SLICE_CONTROL_MUX_MASK;
	v |= CCM_SLICE_CONTROL_MUX((uint32_t)kCLOCK_COMMBUS_ClockRoot_BASE);
	SYSCON__CCM->CLOCK_ROOT[kCLOCK_Root_CGU_COMMBUS_ROOTCLK].SLICE_CONTROL = v;

	v = SYSCON__CCM->CLOCK_ROOT[kCLOCK_Root_CGU_WAKEBUS_ROOTCLK].SLICE_CONTROL;
	v &= ~CCM_SLICE_CONTROL_MUX_MASK;
	v |= CCM_SLICE_CONTROL_MUX((uint32_t)kCLOCK_WAKEBUS_ClockRoot_FRO_192M);
	SYSCON__CCM->CLOCK_ROOT[kCLOCK_Root_CGU_WAKEBUS_ROOTCLK].SLICE_CONTROL = v;

	/* SYSCON_PDMAIN_CLK: park on FRO_48M (no BASE mux option on this slice).
	 * ConfigCGUDig_SYSCON_common() moves it back to SYSPLL_DIV10 post-window.
	 * On re-entry (runtime power-mode switch) it may be on SYSPLL_DIV10 already;
	 * powering SYS PLL down with it still sourced there kills the SYSCON bus.
	 */
	v = SYSCON__CCM->CLOCK_ROOT[kCLOCK_Root_CGU_SYSCON_PDMAIN_CLK].SLICE_CONTROL;
	v &= ~CCM_SLICE_CONTROL_MUX_MASK;
	v |= CCM_SLICE_CONTROL_MUX((uint32_t)kCLOCK_SYSCON_PDMAIN_ClockRoot_FRO_48M);
	SYSCON__CCM->CLOCK_ROOT[kCLOCK_Root_CGU_SYSCON_PDMAIN_CLK].SLICE_CONTROL = v;
	__DSB();
	__ISB();
	(void)SYSCON__CCM->CLOCK_ROOT[kCLOCK_Root_CGU_SYSCON_PDMAIN_CLK].SLICE_CONTROL;

	/* [Step 4] Power down MAIN + CORE + SYS PLL together; wait for RDY to clear
	 * before re-enabling SYS PLL in step 6 (asserting SW_ON while SW_OFF is in
	 * flight can wedge the FSM).
	 */
	v = SYSCON__CGUANA->CGUAD_CTRL_REG;
	v &= ~CGUANA_CGUAD_CTRL_REG_CGUAD_FSM_SW_ON_REQ(cmsFsm);
	v |= CGUANA_CGUAD_CTRL_REG_CGUAD_FSM_SW_OFF_REQ(cmsFsm);
	SYSCON__CGUANA->CGUAD_CTRL_REG = v;
	__DSB();
	__ISB();
	for (i = 0U; ((SYSCON__CGUANA->CGUAD_CTRL_STS &
		       (cmsFsm & CGUANA_CGUAD_CTRL_STS_CGUAD_FSM_RDY_MASK)) != 0U) &&
		     (i < 1000000U);
	     i++) {
	}

	/* [Step 5] Switch CMS and AV PLL reference from FRO192M-derived 24M to SXOSC
	 * (CGUA_CTRL_REG.{CMS,AV}_PLL_CKIN_SEL). Glitchless because all CMS PLLs are off.
	 * CRITICAL: also set CLKGEN_PLL_CKIN_EN together with the SELs -- selecting SXOSC
	 * without enabling PLLCKIN leaves the PLLs with no reference; SYS PLL never
	 * reaches RDY in step 6 and boot dies.
	 */
	v = SYSCON__CGUANA->CGUA_CTRL_REG;
	v |= CGUANA_CGUA_CTRL_REG_CGUA_CLKGEN_PLL_CKIN_EN(1U);
	v |= CGUANA_CGUA_CTRL_REG_CGUA_CLKGEN_CMS_PLL_CKIN_SEL(1U);
	v |= CGUANA_CGUA_CTRL_REG_CGUA_CLKGEN_AV_PLL_CKIN_SEL(1U);
	SYSCON__CGUANA->CGUA_CTRL_REG = v;
	__DSB();
	__ISB();
	soc_clock_select_sxosc_ref(); /* MODCON CLK24M_SEL -> SXOSC */

	/* [Step 6] Re-program SYS PLL from DTCM images and power it up; wait for RDY.
	 * Only SYS PLL is brought back here -- it is the XSPI hop target (steps 7/8).
	 */
	SYSCON__CGUANA->CGUA_SYSPLL_PLL1_REG = soc_clock_syspll_regs[0];
	SYSCON__CGUANA->CGUA_SYSPLL_PLL2_REG = soc_clock_syspll_regs[1];
	SYSCON__CGUANA->CGUA_SYSPLL_PLL3_REG = soc_clock_syspll_regs[2];
	SYSCON__CGUANA->CGUA_SYSPLL_PLL4_REG = soc_clock_syspll_regs[3];
	v = SYSCON__CGUANA->CGUAD_CTRL_REG;
	v &= ~CGUANA_CGUAD_CTRL_REG_CGUAD_FSM_SW_OFF_REQ(CLOCK_CGUANA_FSM_SYSPLL);
	v |= CGUANA_CGUAD_CTRL_REG_CGUAD_FSM_SW_ON_REQ(CLOCK_CGUANA_FSM_SYSPLL);
	SYSCON__CGUANA->CGUAD_CTRL_REG = v;
	for (i = 0U;
	     ((SYSCON__CGUANA->CGUAD_CTRL_STS &
	       (CLOCK_CGUANA_FSM_SYSPLL & CGUANA_CGUAD_CTRL_STS_CGUAD_FSM_RDY_MASK)) == 0U) &&
	     (i < 1000000U);
	     i++) {
	}

	/* [Step 7] Bring up SYSPLLDIV4_ROOTCLK (SysPLL DIV4 = 500 MHz, div=1). */
	v = SYSCON__CCM->CLOCK_ROOT[kCLOCK_Root_CGU_SYSPLLDIV4_ROOTCLK].SLICE_CONTROL;
	v &= ~(CCM_SLICE_CONTROL_MUX_MASK | CCM_SLICE_CONTROL_DIV_MASK);
	v |= CCM_SLICE_CONTROL_MUX((uint32_t)kCLOCK_SYSPLLDIV4_ClockRoot_SYSPLL_DIV4) |
	     CCM_SLICE_CONTROL_DIV(1U - 1U);
	SYSCON__CCM->CLOCK_ROOT[kCLOCK_Root_CGU_SYSPLLDIV4_ROOTCLK].SLICE_CONTROL = v;
	__DSB();
	__ISB();

	/* [Step 8] Hop both XSPI fclocks onto SYS PLL and re-enable. On return,
	 * XSPI0 XIP and XSPI1 PSRAM are both alive.
	 */
	soc_clock_park_xspi0(kSocXspiRunOnSysPllDiv4);
	soc_clock_park_xspi1(kSocXspiRunOnSysPllDiv4);

	/* [Step 9] Restore LLC policy and L1 caches now that XIP + PSRAM are alive. */
	CMPT__LLC->CCUCTCR = llcCtcr;
	__DSB();
	__ISB();
	if (iCacheOn) {
		SCB_EnableICache();
	}
	if (dCacheOn) {
		SCB_EnableDCache();
	}
}

