zephyrproject-rtos/zephyr/soc/nxp/imxrt/imxrt266x/soc_clock.c
/*
 * Scratch stack for the window. The window parks XSPI1, so a stack in the PSRAM
 * behind it disappears for as long as the window is open -- and step 0 disables
 * the L1 D-cache and the LLC, so every access really does reach the parked
 * controller. The DTCM is clocked by neither XSPI. The window runs pre-kernel
 * with interrupts locked and nothing nests on it, so the depth of the window
 * call chain is all this has to hold: 40 bytes at the default optimization
 * level, the helpers it calls being leaves. Sized well above that so an
 * unoptimized build does not quietly overrun it; the DTCM is 256 KB.
 *
 * Only the running stack is moved. MSP is left where it is: a fault inside the
 * window is unrecoverable however the stacks are placed, because the handler and
 * the vector table are in the XIP flash the window disables, so exception entry
 * cannot even fetch.
 */
static uint8_t __dtcm_noinit_section __aligned(8) soc_clock_window_stack[512];

/*
 * Runs the window on soc_clock_window_stack, in soc_clock_window.S. Plain
 * assembly, so nothing the compiler emits can touch the stack being switched
 * away from; see that file for the register contract.
 */
extern void soc_clock_call_on_stack(void (*fn)(void), void *stack_top);

/* Shared, mode-invariant prologue: FROs + SXOSC (pre-window), the RAM window,
 * then Audio/Video PLLs post-window. Core/Main PLL are deferred to the caller.
 */
static void soc_clock_prepare(void)
{
	unsigned int key;
#if defined(CONFIG_BUILTIN_STACK_GUARD)
	uint32_t psplim;
#endif

	/*
	 * The SDK sets the LPUART0 functional-clock root to the crystal here so
	 * its examples have a console before the PLLs exist. Zephyr's console
	 * comes up long after this hook, and the root belongs to the
	 * nxp,imx-ccm-rev3-root node in devicetree, so it is not set here.
	 */

	/* Step 1 (pre-window, flash): FROs + SXOSC. CLOCK_InitSxosc's FSM RDY wait ensures
	 * the crystal is stable before the window references it. This does not disturb the
	 * running ROM Main PLL that XSPI0/XSPI1 ride.
	 */
	ConfigCGUAna();

	/* Compute the SYSPLL register images while flash is up (the window is flash-free). */
	soc_clock_compute_sys_pll_regs(&s_sysPllConfig, &soc_clock_syspll_regs[0],
				       &soc_clock_syspll_regs[1], &soc_clock_syspll_regs[2],
				       &soc_clock_syspll_regs[3]);

	/* Step 2 (RAM window): glitchless crystal hand-over.
	 *
	 * Both XSPI controllers are disabled inside the window, so any instruction,
	 * vector or literal fetch that lands in external memory while it is open
	 * wedges XIP. The SDK leaves interrupt masking to the caller; do it here so
	 * the requirement travels with the window rather than with whoever calls
	 * this. The window functions themselves are __itcm_section, and the data they
	 * touch is on the stack or in .data.
	 *
	 * The stack must not reside in any memory region whose clock is modified
	 * during the window. Both XSPI controllers are parked here, so the PSRAM
	 * (XSPI1) the running stack normally lives in is off-limits, as is the NOR
	 * XIP (XSPI0). The window therefore runs on soc_clock_window_stack in the
	 * DTCM; PSPLIM is released across the switch because the scratch stack sits
	 * below the limit the current stack was given.
	 */
	key = irq_lock();
#if defined(CONFIG_BUILTIN_STACK_GUARD)
	psplim = __get_PSPLIM();
	__set_PSPLIM(0U);
#endif
	soc_clock_call_on_stack(soc_clock_handover_to_sxosc,
				&soc_clock_window_stack[sizeof(soc_clock_window_stack)]);
#if defined(CONFIG_BUILTIN_STACK_GUARD)
	__set_PSPLIM(psplim);
#endif
	irq_unlock(key);

	/* Step 3 (post-window, flash): AV PLLs lock fresh on the SXOSC reference. */
	CLOCK_InitAudioPll(&s_audioPllConfig);
	CLOCK_InitVideoPll(&s_videoPllConfig);
}

/* Over Drive Run (HpRun): CorePLL 792 MHz, MainPLL DIVOUT1 1000 MHz. */
static void soc_clock_apply_od_run(void)
{
	soc_clock_prepare();
	/* Per-mode tail -- config globals used directly. Both PLLs must be locked before
	 * ConfigCGUDig_SYSCON_common() (it sources PLL_PFDX <- MAINPLL_DIVOUT1 and
	 * COMMPFDX <- COREPLL_OUT).
	 */
	CLOCK_InitCorePll(&s_corePllConfig); /* 792 MHz */
	CLOCK_InitMainPll(&s_mainPllConfig); /* DIVOUT1 = 1000 MHz */
	ConfigCGUDig_SYSCON_common();        /* CGU slices identical across modes */
	ConfigCGUDig_SYSCON_HPRUN();         /* CGU slices 30/31/32 for HpRun */
	ConfigCGUDig_SS();                   /* CMPT / MAIN / MEDIA / AUDIO / COMM / WAKE */
}

/*******************************************************************************
 * Static helpers
 *****************************************************************************
 */

/* Initialize the pre-window analog oscillators: FRO12M, FRO192M, SXOSC. PLLs are deferred. */
static void ConfigCGUAna(void)
{
	/* LPOSC_12M, LPOSC_1M and LPOSC_32K stay at reset; nothing here uses them. */

	/* FRO12M first: the fallback reference, kept alive for the subsequent analog init. */
	CLOCK_InitFro12M(&s_fro12mConfig);

	/* FRO 192 MHz -- the core/bus/XSPI park clock for the RAM window. */
	CLOCK_InitFro192M(&s_fro192mConfig);

	/* SXOSC 24 MHz crystal -- the new PLL reference; the FSM RDY wait inside
	 * CLOCK_InitSxosc ensures it is stable before the RAM window references it.
	 */
	CLOCK_InitSxosc(&s_sxoscConfig);
}

/* The six subsystem-domain helpers, all mode-invariant. The per-mode CGU slices
 * (30 MAIN_ROOTCLK, 31 NPU_ROOTCLK, 32 MEDIABUS_ROOTCLK) are programmed
 * separately by ConfigCGUDig_SYSCON_HPRUN() -- see soc_clock_apply_od_run().
 *
 * The CMPT / MAIN / MEDIA domain slices track their upstream CGU roots via
 * mux=MAIN/NPU/MEDIABUS with div!=1 (e.g. CMPT.main_clk_divided = MAIN/3), so
 * they follow whatever the per-mode CGU root is set to -- no per-mode variant of
 * CMPT/MAIN/MEDIA is needed.
 *
 * Each helper below keeps one mutable rootCfg and reuses it across its
 * CLOCK_SetRootClock() calls, with sndDiv = 1 set once as a baseline:
 * CLOCK_SetRootClock writes div and sndDiv using a (value-1) encoding, so a
 * zero-initialised sndDiv would write an all-ones SND_DIV field and corrupt the
 * secondary divider on any root that uses it.
 */
static void ConfigCGUDig_SS(void)
{
	ConfigCGUDig_MEDIA();
	ConfigCGUDig_AUDIO();
	ConfigCGUDig_CMPT();
	ConfigCGUDig_MAIN();
	ConfigCGUDig_COMM();
	ConfigCGUDig_WAKE();
}

