zephyrproject-rtos/zephyr/soc/nxp/imxrt/imxrt266x/soc_clock.c
/*
 * The 49 SYSCON_CCM slices, in slice-index order. Slices with a single possible
 * source (BASE, LOW, the SAI master clocks, SXOSC and the LPOSC fan-out) are set
 * here because there is nothing to choose; the PLL-distribution slices come from
 * their nxp,imx-ccm-rev3-root nodes, which is where their values live. Slices no
 * consumer in this baseline needs are left at reset.
 */
static void ConfigCGUDig_SYSCON_common(void)
{
	clock_root_config_t rootCfg = {0};

	rootCfg.sndDiv = 1U;

	/*
	 * MODCON clock-tree muxes. The six Mx /2 selects feed XSPI0/XSPI1 (MAIN) and
	 * USDHC0/USDHC1 (COMM); default them to pass-through so consumers see the
	 * full root frequency. OSC_24M is not routed here -- the RAM window already
	 * switched it to SXOSC with the core parked.
	 */
	CLOCK_SetClockSrcDiv2(kCLOCK_SRC_MAINPFDX_DIV2, false);
	CLOCK_SetClockSrcDiv2(kCLOCK_SRC_MAIN_PERI0_DIV2, false);
	CLOCK_SetClockSrcDiv2(kCLOCK_SRC_MAIN_PERI1_DIV2, false);
	CLOCK_SetClockSrcDiv2(kCLOCK_SRC_COMMPFDX_DIV2, false);
	CLOCK_SetClockSrcDiv2(kCLOCK_SRC_COMM_PERI1_DIV2, false);
	CLOCK_SetClockSrcDiv2(kCLOCK_SRC_COMM_PERI2_DIV2, false);

	rootCfg.mux = kCLOCK_BASE_ClockRoot_FRO_192M;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_CGU_BASE_CLK, &rootCfg);

	rootCfg.mux = kCLOCK_LOW_ClockRoot_FRO_24M;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_CGU_LOW_CLK, &rootCfg);

	/* PLL-distribution and PFD layer: steady values from devicetree. */
	SOC_SET_ROOT_CLOCK(DT_NODELABEL(mainpll_divx_rootclk));
	SOC_SET_ROOT_CLOCK(DT_NODELABEL(syspll_divx_rootclk));
	SOC_SET_ROOT_CLOCK(DT_NODELABEL(pll_pfdx_rootclk));
	SOC_SET_ROOT_CLOCK(DT_NODELABEL(media_pfdx_rootclk));
	SOC_SET_ROOT_CLOCK(DT_NODELABEL(mainpfdx_rootclk));
	SOC_SET_ROOT_CLOCK(DT_NODELABEL(commpfdx_rootclk));
	SOC_SET_ROOT_CLOCK(DT_NODELABEL(maindivx_rootclk));

	rootCfg.mux = kCLOCK_SAIMCLK_ClockRoot_SAI1_MCLK;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_CGU_SAIMCLK_ROOTCLK, &rootCfg);

	rootCfg.mux = kCLOCK_SAIMCLK0_ClockRoot_SAI0_MCLK;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_CGU_SAIMCLK0_ROOTCLK, &rootCfg);

	rootCfg.mux = kCLOCK_SAIMCLK1_ClockRoot_SAI1_MCLK;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_CGU_SAIMCLK1_ROOTCLK, &rootCfg);

	rootCfg.mux = kCLOCK_SAIMCLK2_ClockRoot_SAI2_MCLK;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_CGU_SAIMCLK2_ROOTCLK, &rootCfg);

	rootCfg.mux = kCLOCK_SXOSC_ClockRoot_OSC_24M;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_CGU_SXOSC_ROOTCLK, &rootCfg);

	rootCfg.mux = kCLOCK_LP12M_CORE_ClockRoot_LPOSC_12M_CORE;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_CGU_LP12M_CORE_ROOTCLK, &rootCfg);

	rootCfg.mux = kCLOCK_LP1M_CORE_ClockRoot_LPOSC_1M_CORE;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_CGU_LP1M_CORE_ROOTCLK, &rootCfg);

	rootCfg.mux = kCLOCK_ULP32K_ClockRoot_LPOSC32K;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_CGU_ULP32K_ROOTCLK, &rootCfg);

	rootCfg.mux = kCLOCK_FRO192M_ClockRoot_FRO_192M;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_CGU_FRO192M_ROOTCLK, &rootCfg);

	rootCfg.mux = kCLOCK_FRO96M_ClockRoot_FRO_96M;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_CGU_FRO96M_ROOTCLK, &rootCfg);

	rootCfg.mux = kCLOCK_FRO48M_ClockRoot_FRO_48M;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_CGU_FRO48M_ROOTCLK, &rootCfg);

	rootCfg.mux = kCLOCK_FRO24M_ClockRoot_FRO_24M;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_CGU_FRO24M_ROOTCLK, &rootCfg);

	/* SYSPLL/MAINPLL distribution roots on the core/bus/XSPI path: from devicetree. */
	SOC_SET_ROOT_CLOCK(DT_NODELABEL(sysplldiv4_rootclk));
	SOC_SET_ROOT_CLOCK(DT_NODELABEL(sysplldiv5_rootclk));
	SOC_SET_ROOT_CLOCK(DT_NODELABEL(sysplldivx_rootclk));
	SOC_SET_ROOT_CLOCK(DT_NODELABEL(mainplldivx_rootclk));

	rootCfg.mux = kCLOCK_MAINPLLDIV8_ClockRoot_MAINPLL_DIV8;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_CGU_MAINPLLDIV8_ROOTCLK, &rootCfg);

	rootCfg.mux = kCLOCK_MAINPLLDIV10_ClockRoot_MAINPLL_DIV10;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_CGU_MAINPLLDIV10_ROOTCLK, &rootCfg);

	rootCfg.mux = kCLOCK_MAINPLLDIV20_ClockRoot_MAINPLL_DIV20;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_CGU_MAINPLLDIV20_ROOTCLK, &rootCfg);

	rootCfg.mux = kCLOCK_AUDIOPLL_ClockRoot_AUDIOPLL_DIVOUT;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_CGU_AUDIOPLL_ROOTCLK, &rootCfg);

	rootCfg.mux = kCLOCK_VIDEOPLL_ClockRoot_VIDEOPLL_DIVOUT;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_CGU_VIDEOPLL_ROOTCLK, &rootCfg);

	/* CGU slices 30 (MAIN_ROOTCLK / CM85), 31 (NPU_ROOTCLK), 32 (MEDIABUS_ROOTCLK)
	 * are programmed by ConfigCGUDig_SYSCON_HPRUN() -- they are the per-mode
	 * slices, and only HP RUN is carried here.
	 */

	/* Bus roots (33-36): steady values from devicetree. */
	SOC_SET_ROOT_CLOCK(DT_NODELABEL(audiobus_rootclk));
	SOC_SET_ROOT_CLOCK(DT_NODELABEL(commbus_rootclk));
	SOC_SET_ROOT_CLOCK(DT_NODELABEL(wakebus_rootclk));
	SOC_SET_ROOT_CLOCK(DT_NODELABEL(syscon_pdmain_rootclk));

	rootCfg.mux = kCLOCK_PERI0_ClockRoot_MAINPLL_DIVOUT0;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_CGU_PERI_ROOTCLK0, &rootCfg);

	rootCfg.mux = kCLOCK_PERI1_ClockRoot_MAINPLL_DIVOUT1;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_CGU_PERI_ROOTCLK1, &rootCfg);

	rootCfg.mux = kCLOCK_PERI2_ClockRoot_MAINPLL_DIVOUT2;
	rootCfg.div = 2U;
	CLOCK_SetRootClock(kCLOCK_Root_CGU_PERI_ROOTCLK2, &rootCfg);

	/* PERI3 feeds the console LPUART; steady value from devicetree. */
	SOC_SET_ROOT_CLOCK(DT_NODELABEL(peri3_rootclk));

	rootCfg.mux = kCLOCK_PERI4_ClockRoot_MAINPLL_DIVX;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_CGU_PERI_ROOTCLK4, &rootCfg);

	rootCfg.mux = kCLOCK_PERI5_ClockRoot_MAINPLL_DIVX;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_CGU_PERI_ROOTCLK5, &rootCfg);

	rootCfg.mux = kCLOCK_PERI6_ClockRoot_BASE;
	rootCfg.div = 8U;
	CLOCK_SetRootClock(kCLOCK_Root_CGU_PERI_ROOTCLK6, &rootCfg);

	rootCfg.mux = kCLOCK_PERI7_ClockRoot_FRO_192M;
	rootCfg.div = 5U;
	CLOCK_SetRootClock(kCLOCK_Root_CGU_PERI_ROOTCLK7, &rootCfg);

	rootCfg.mux = kCLOCK_AUDIO_ClockRoot_LOW;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_CGU_AUDIO_ROOTCLK, &rootCfg);

	rootCfg.mux = kCLOCK_VIDEO_ClockRoot_BASE;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_CGU_VIDEO_ROOTCLK, &rootCfg);

	rootCfg.mux = kCLOCK_USB1_ClockRoot_FRO_48M;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_CGU_USB1_ROOTCLK, &rootCfg);

	rootCfg.mux = kCLOCK_ETH_ClockRoot_SYSPLL_DIV20;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_CGU_ETH_ROOTCLK, &rootCfg);
}

/* Per-mode CGU slices for HpRun (Over Drive Run FBB) -- Jira table column 1:
 *
 *  Slice 30  MAIN_ROOTCLK      PLL_PFDX          -> 1000 MHz  (CM85)
 *  Slice 31  NPU_ROOTCLK       COREPLL_OUT       -> 792 MHz   (NPU; spec-nominal 800)
 *  Slice 32  MEDIABUS_ROOTCLK  PLL_PFDX / 3      -> 333 MHz   (MEDIA)
 *
 * Downstream: CMPT.cpu_clk = MAIN_ROOTCLK/1 = 1000 (CM85 CPU clock);
 * CMPT.cmpt_clk = MAIN_ROOTCLK/1 with sndDiv=1 -> also 1000; MAIN.main_clk_divided
 * = MAIN_ROOTCLK/3 -> 333 MHz (MAIN bus / CMPT bus target).
 */
static void ConfigCGUDig_SYSCON_HPRUN(void)
{
	/* The three per-mode slices come from devicetree:
	 *   root 30 MAIN     -- two dividers: div -> CPU_ROOTCLK (CM85 core), sndDiv ->
	 *                       MAIN_ROOTCLK (MAIN bus). HpRun: CM85 = 1000, MAIN = 333 MHz,
	 *                       so clock-div=<1> / clock-second-div=<3>. Uses the *_SD macro.
	 *   root 31 NPU      -- COREPLL_OUT (= 792 MHz per s_corePllConfig).
	 *   root 32 MEDIABUS -- PLL_PFDX (=1000 MHz) / 3 = 333.33 MHz.
	 */
	SOC_SET_ROOT_CLOCK_SD(DT_NODELABEL(main_rootclk));
	SOC_SET_ROOT_CLOCK(DT_NODELABEL(npu_rootclk));
	SOC_SET_ROOT_CLOCK(DT_NODELABEL(mediabus_rootclk));
}

