zephyrproject-rtos/zephyr/soc/nxp/imxrt/imxrt266x/soc_clock.c
/*
 * CMPT domain clock roots (5 slices on CMPT_CCM). Slice 3 is listed for
 * completeness but is not set here -- see the note in the body.
 *
 *  Slice  Root Name       Mux  Source   Div  Yield
 *  -----  -------------  ---  ------  ---  ----------
 *     0   cmpt_clk         0  MAIN      1  1000 MHz
 *     1   cpu_clk          0  CPU       1  1000 MHz
 *     2   npu_clk          0  NPU       1  792 MHz
 *     3   systick_clk0     1  SXOSC     1  24 MHz   (from devicetree)
 *     4   systick_clk1     1  SXOSC     1  24 MHz
 */
static void ConfigCGUDig_CMPT(void)
{
	clock_root_config_t rootCfg = {0};

	rootCfg.sndDiv = 1U;

	rootCfg.mux = kCLOCK_CMPT_ClockRoot_MAIN;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_CMPT_cmpt_clk, &rootCfg);

	rootCfg.mux = kCLOCK_CPU_ClockRoot_CPU;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_CMPT_cpu_clk, &rootCfg);

	rootCfg.mux = kCLOCK_NPU_ClockRoot_NPU;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_CMPT_npu_clk, &rootCfg);

	/*
	 * systick_clk0 (SXOSC = 24 MHz) is the secure SysTick reference and is
	 * programmed from its nxp,imx-ccm-rev3-root devicetree node, which is
	 * also where CONFIG_SYS_CLOCK_HW_CYCLES_PER_SEC has to agree with it.
	 * systick_clk1 below is the non-secure reference; this image runs
	 * secure, so nothing consumes it and it stays here.
	 */

	rootCfg.mux = kCLOCK_SYSTICK1_ClockRoot_SXOSC;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_CMPT_systick_clk1, &rootCfg);
}

/*
 * MAIN domain (37 slices on MAIN_CCM). Only the two roots that no single
 * device owns are set here: fro192m (FRO192M) and ulp32k (ULP32K).
 *
 * Of the per-peripheral leaf roots, the LPUART ones are carried as an inline
 * "source" clocks entry on each lpuart node and programmed by that driver at
 * init; the XSPI ones are declared the same way but written by the hand-over
 * window above. The rest (lpspi, lpi2c, i3c, flexcan, flexio, adc, lpit, qtpm,
 * sinc, tpiu, cssi, otp, clkout) are described nowhere yet and keep their reset
 * values -- add a "source" entry, or a MAIN_CCM root child, when a driver needs
 * a rate other than that.
 */
static void ConfigCGUDig_MAIN(void)
{
	clock_root_config_t rootCfg = {0};

	rootCfg.sndDiv = 1U;

	rootCfg.mux = kCLOCK_MAIN_MAIN_FRO192M_ClockRoot_FRO192M;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_MAIN_fro192m, &rootCfg);

	rootCfg.mux = kCLOCK_MAIN_MAIN_ULP32K_ClockRoot_ULP32K;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_MAIN_ulp32k, &rootCfg);
}

/*
 * MEDIA domain (10 slices on MEDIA_CCM). Only the two domain-base roots are
 * set here: media_clk (MEDIABUS) and mediapll_clk (MAINPLLDIV10). The
 * per-peripheral leaf roots (mipicsi, mipidsi, reformat, dcpixel, csi) are not
 * described anywhere yet and keep their reset values.
 */
static void ConfigCGUDig_MEDIA(void)
{
	POWER_SetDomainRunMode(kPOWER_DomainMedia, kPDCON_EventNoneOrActive);
	clock_root_config_t rootCfg = {0};

	rootCfg.sndDiv = 1U;

	rootCfg.mux = kCLOCK_MEDIA_ClockRoot_MEDIABUS;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_MEDIA_media_clk, &rootCfg);

	rootCfg.mux = kCLOCK_MEDIAPLL_ClockRoot_MAINPLLDIV10;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_MEDIA_mediapll_clk, &rootCfg);
}

/*
 * AUDIO domain (11 slices on AUDIO_CCM). Only the domain-base root is set
 * here: audio_clk (AUDIOBUS). The per-peripheral leaf roots (dmic, sai,
 * spdif, asrc) are not described anywhere yet and keep their reset values.
 */
static void ConfigCGUDig_AUDIO(void)
{
	clock_root_config_t rootCfg = {0};

	rootCfg.sndDiv = 1U;

	rootCfg.mux = kCLOCK_AUDIO_CLK_ClockRoot_AUDIOBUS;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_AUDIO_audio_clk, &rootCfg);
}

/*
 * COMM domain (17 slices on COMM_CCM). Only the two domain-base roots are
 * set here: comm_clk (COMMBUS) and comm_ulp32k (ULP32K). The per-peripheral
 * leaf roots (usdhc, xspir, usb, eth, xeno, dll) are not described anywhere yet
 * and keep their reset values.
 */
static void ConfigCGUDig_COMM(void)
{
	clock_root_config_t rootCfg = {0};

	rootCfg.sndDiv = 1U;

	rootCfg.mux = kCLOCK_COMM_ClockRoot_COMMBUS;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_COMM_comm_clk, &rootCfg);

	rootCfg.mux = kCLOCK_COMM_ULP32K_ClockRoot_ULP32K;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_COMM_comm_ulp32k, &rootCfg);
}

/*
 * WAKE domain (27 slices on WAKE_CCM), the always-on peripheral roots. Only the
 * six domain-base roots are set here: wake_clk (WAKEBUS), wake_sxosc (SXOSC),
 * wake_lp1m (LP1M_WAKE), wake_lp12m (LP12M_WAKE), wake_ulp32k (ULP32K),
 * wake_lpclk (LP1M_WAKE).
 *
 * Per-peripheral leaf roots (lpspi, lpi2c, i3c, qtpm, lptmr, swt, ewm, acmp,
 * dmic) keep their reset values; the two WAKE LPUARTs use inline "source" clock
 * entries and are programmed by their driver at init.
 *
 * TBD: confirm with IC team that LP1M_WAKE, LP12M_WAKE, LP2M_WAKE are routed to
 * the WAKE_CCM domain at boot, and whether any need explicit PMU enable.
 */
static void ConfigCGUDig_WAKE(void)
{
	clock_root_config_t rootCfg = {0};

	rootCfg.sndDiv = 1U;

	rootCfg.mux = kCLOCK_WAKE_ClockRoot_WAKEBUS;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_WAKE_wake_clk, &rootCfg);

	rootCfg.mux = kCLOCK_WAKE_SXOSC_ClockRoot_SXOSC;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_WAKE_wake_sxosc, &rootCfg);

	rootCfg.mux = kCLOCK_WAKE_LP1M_ClockRoot_LP1M_WAKE;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_WAKE_wake_lp1m, &rootCfg);

	rootCfg.mux = kCLOCK_WAKE_LP12M_ClockRoot_LP12M_WAKE;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_WAKE_wake_lp12m, &rootCfg);

	rootCfg.mux = kCLOCK_WAKE_ULP32K_ClockRoot_ULP32K;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_WAKE_wake_ulp32k, &rootCfg);

	rootCfg.mux = kCLOCK_WAKE_LPCLK_ClockRoot_LP1M_WAKE;
	rootCfg.div = 1U;
	CLOCK_SetRootClock(kCLOCK_Root_WAKE_wake_lpclk, &rootCfg);

	SystemCoreClockUpdate();
}
